src/cf/InformationRegisters/Otus_ЭтапыОнбординга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Otus_ЭтапыОнбординга</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.otus_СтатусыЭтапаОнбординга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дедлайн</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФакта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>CorrelationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LastRequestId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.otus_ЗаявкаОнбординг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.otus_ТипыЭтапов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/otus_СтатусыЭтапаОнбординга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>otus_СтатусыЭтапаОнбординга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/otus_СтатусыЗаявкиОнбординга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>otus_СтатусыЗаявкиОнбординга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Звершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/RMQ_Сообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>RMQ_Сообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Exchange</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/otus_РегламентныеЗадания/Ext/Module.bsl
Процедура otus_ПолучитьСообщенияRMQ() Экспорт
    ГуидКомпоненты = Новый УникальныйИдентификатор();
    Сервер = Онбординг_RMQ.ПолучитьПараметрыСервераRMQ();
	Exchange = Новый Структура("ТочкаОбмена, ИмяОчереди", "", "hr.onboarding.replies");
    КлиентКомпоненты  = Онбординг_RMQ.ПолучитьКомпонентуСервер(ГУИДКомпоненты);
    Сообщение = "";
	Онбординг_RMQ.ПрочитатьСообщениеИзОчереди(КлиентКомпоненты, Сервер, Exchange);
    ОбновитьДвиженияРегистраRMQ();
    ЗакрытьСвязанныеЗаявки();
КонецПроцедуры

Процедура ОбновитьДвиженияРегистраRMQ() Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   RMQ_Сообщения.Ссылка КАК Ссылка,
        |   RMQ_Сообщения.Exchange КАК Exchange,
        |   RMQ_Сообщения.ТелоСообщения КАК ТелоСообщения
        |ИЗ
        |   Справочник.RMQ_Сообщения КАК RMQ_Сообщения
        |ГДЕ
        |   НЕ RMQ_Сообщения.Обработано";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        ОбъектСообщение = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
        ТелоСообщения = ВыборкаДетальныеЗаписи.ТелоСообщения.Получить();
        СтруктураСообщения = СтрокуJSONВСтруктуру(ТелоСообщения);
               
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |   Otus_ЭтапыОнбординга.Заявка КАК Заявка,
        |   Otus_ЭтапыОнбординга.ТипЭтапа КАК ТипЭтапа,
        |   Otus_ЭтапыОнбординга.НомерЭтапа КАК НомерЭтапа,
        |   Otus_ЭтапыОнбординга.СтатусЭтапа КАК СтатусЭтапа,
        |   Otus_ЭтапыОнбординга.Дедлайн КАК Дедлайн,
        |   Otus_ЭтапыОнбординга.ДатаФакта КАК ДатаФакта,
        |   Otus_ЭтапыОнбординга.Просрочен КАК Просрочен,
        |   Otus_ЭтапыОнбординга.CorrelationId КАК CorrelationId,
        |   Otus_ЭтапыОнбординга.LastRequestId КАК LastRequestId,
        |   Otus_ЭтапыОнбординга.ДатаОтправки КАК ДатаОтправки,
        |   Otus_ЭтапыОнбординга.ДатаОтвета КАК ДатаОтвета,
        |   Otus_ЭтапыОнбординга.РезультатТекст КАК РезультатТекст,
        |   Otus_ЭтапыОнбординга.ОшибкаКод КАК ОшибкаКод,
        |   Otus_ЭтапыОнбординга.ОшибкаТекст КАК ОшибкаТекст
        |ИЗ
        |   РегистрСведений.Otus_ЭтапыОнбординга КАК Otus_ЭтапыОнбординга
        |ГДЕ
        |   Otus_ЭтапыОнбординга.CorrelationId = &CorrelationId";
        
        Запрос.УстановитьПараметр("CorrelationId", СтруктураСообщения.correlation_id);
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ВыборкаЭтапы = РезультатЗапроса.Выбрать();
        
        Если ВыборкаЭтапы.Следующий() Тогда
            Набор = РегистрыСведений.Otus_ЭтапыОнбординга.СоздатьНаборЗаписей();
            Набор.Отбор.Заявка.Установить(ВыборкаЭтапы.Заявка);
            Набор.Отбор.ТипЭтапа.Установить(ВыборкаЭтапы.ТипЭтапа);
            Набор.Отбор.НомерЭтапа.Установить(ВыборкаЭтапы.НомерЭтапа);
            Набор.Прочитать();
            Если Набор.Количество() Тогда
                Запись = Набор[0];
                Запись.СтатусЭтапа = ?(ЗначениеЗаполнено(СтруктураСообщения.error), Перечисления.otus_СтатусыЭтапаОнбординга.Ошибка, Перечисления.otus_СтатусыЭтапаОнбординга.Выполнено);
                Запись.LastRequestId = СтруктураСообщения.request_id;
                Запись.ДатаОтвета = ПрочитатьДатуJSON(СтруктураСообщения.received_at, ФорматДатыJSON.ISO);
                Запись.Просрочен = Запись.ДатаОтвета > Запись.Дедлайн;
                Набор.Записать();
            КонецЕсли;
        КонецЕсли;
        
        СообщениеRMQ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
        СообщениеRMQ.Обработано = Истина;
        СообщениеRMQ.Записать();
        
    КонецЦикла;

КонецПроцедуры

Функция СформироватьСодержаниеЗадачи(СтруктураСообщения)
    
    Результат = "";
    
    Если СтруктураСообщения.message_type = "access_package" Тогда
        Результат = СтрШаблон(НСтр("ru='Создать ""%1"" для сотрудника %2(%3) из подразделения %4'", "ru"), 
        СтруктураСообщения.payload.access_package, СтруктураСообщения.employee.full_name, СтруктураСообщения.employee.id, СтруктураСообщения.employee.department);
    Иначе
        Результат = СтрШаблон(НСтр("ru='Выдать ""%1(%5)"" для сотрудника %2(%3) из подразделения %4'", "ru"), 
        СтруктураСообщения.payload.asset_issue, СтруктураСообщения.employee.full_name, СтруктураСообщения.employee.id, СтруктураСообщения.employee.department, СтруктураСообщения.payload.asset_tag);
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

Функция СтрокуJSONВСтруктуру(Значение)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);

	Результат = ПрочитатьJSON(ЧтениеJSON);

	ЧтениеJSON.Закрыть();

	Возврат Результат;

КонецФункции

Процедура ЗакрытьСвязанныеЗаявки()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |   Otus_ЭтапыОнбординга.Заявка КАК Заявка
        |ПОМЕСТИТЬ ВТ_Заявки
        |ИЗ
        |   РегистрСведений.Otus_ЭтапыОнбординга КАК Otus_ЭтапыОнбординга
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ВТ_Заявки.Заявка КАК Заявка
        |ПОМЕСТИТЬ ВТ_ОткрытыеЗаявки
        |ИЗ
        |   ВТ_Заявки КАК ВТ_Заявки
        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Otus_ЭтапыОнбординга КАК Otus_ЭтапыОнбординга
        |       ПО ВТ_Заявки.Заявка = Otus_ЭтапыОнбординга.Заявка
        |ГДЕ
        |   Otus_ЭтапыОнбординга.СтатусЭтапа <> &СтатусЭтапаВыполнено
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   otus_ЗаявкаОнбординг.Ссылка КАК Ссылка
        |ИЗ
        |   Документ.otus_ЗаявкаОнбординг КАК otus_ЗаявкаОнбординг
        |ГДЕ
        |   НЕ otus_ЗаявкаОнбординг.Ссылка В
        |               (ВЫБРАТЬ
        |                   ВТ_ОткрытыеЗаявки.Заявка
        |               ИЗ
        |                   ВТ_ОткрытыеЗаявки)";
    
    Запрос.УстановитьПараметр("СтатусЭтапаВыполнено", Перечисления.otus_СтатусыЭтапаОнбординга.Выполнено);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        ЗаявкаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
        ЗаявкаОбъект.Статус = Перечисления.otus_СтатусыЗаявкиОнбординга.Звершено;
        ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
    КонецЦикла;

КонецПроцедуры
